// base url
export const BASEURL = 'http://localhost:8080/';

/*************************************************************************************
 * 회원
 *************************************************************************************/
export const CHKDUPIDURL = 'login/getDupCnt.do'; // 아이디중복체크
export const JOINURL = 'login/joinUser.do';      // 회원가입
export const LOGINURL = 'login/getUserId.do';    // 로그인

/*************************************************************************************
 * 게시글
 *************************************************************************************/
export const POSTLISTURL = 'post/getPostList.do'; // 게시글리스트
export const POSTEDITURL = 'post/editPost.do'; // 게시글리스트

/*************************************************************************************
 * 코드
 *************************************************************************************/
export const CODELISTURL = 'comm/getCodeList.do'; // 코드리스트